# Pandas DataFrame

In [12]:
import pandas as pd
import numpy as np
from numpy.random import randn # Random numbers

In [13]:
my_data = randn(4,3) # Rows, Columns
my_rows = ["A", "B", "C", "D"]
my_columns = ["Monday", "Tuesday", "Friday"]

Create a DataFrame

In [14]:
# Create DataFrame
my_df = pd.DataFrame(my_data, my_rows, my_columns)
my_df

     Monday   Tuesday    Friday
A -0.575453  0.958498  0.919990
B -0.420363  0.746683 -1.299072
C -0.434552 -0.772943  0.402921
D -0.289370 -0.482927  0.561345

In [15]:
# Create DataFrame
my_df = pd.DataFrame(data=my_data, index=my_rows, columns=my_columns)
my_df

     Monday   Tuesday    Friday
A -0.575453  0.958498  0.919990
B -0.420363  0.746683 -1.299072
C -0.434552 -0.772943  0.402921
D -0.289370 -0.482927  0.561345

DataFrame from an imported csv file

In [16]:
# import csv file
df2 = pd.read_csv('data/dog_data.csv')
df2

                    Breed              Color        DogName  OwnerZip
0                COCKAPOO              BROWN        CHARLEY     15236
1            GER SHEPHERD        BLACK/BROWN         TACODA     15238
2           BELG MALINOIS            BRINDLE           EICH     15238
3                   MIXED        BLACK/BROWN          ARROW     15104
4     AM PIT BULL TERRIER        WHITE/BROWN         OAKLEY     15139
...                   ...                ...            ...       ...
2665         GOLDENDOODLE              BROWN        WINSLOW     15044
2666    YORKSHIRE TERRIER        BLACK/BROWN  ROCKY KALAKOS     15220
2667              LAB MIX  WHITE/BLACK/BROWN          ELLIE     15220
2668         GOLDENDOODLE              WHITE       CLARENCE     15143
2669    SHETLAND SHEEPDOG              BLACK        GRIFFIN     15136

[2670 rows x 4 columns]

Pull rows out the DataFrame loaded from the csv

**loc** stands for location

In [17]:
# Pull out rows
# Get first row
df2.loc[0]

Breed       COCKAPOO
Color          BROWN
DogName      CHARLEY
OwnerZip       15236
Name: 0, dtype: object

Pull out multiple rows

In [18]:
# Pull out multiple rows
# row 0 and 5
df2.loc[[0,5]]

              Breed  Color  DogName  OwnerZip
0          COCKAPOO  BROWN  CHARLEY     15236
5  SCOTTISH TERRIER  BLACK   BAILEY     15129

In [19]:
# row 0, 5 and 8
df2.loc[[0, 5, 8]]

               Breed        Color     DogName  OwnerZip
0           COCKAPOO        BROWN     CHARLEY     15236
5   SCOTTISH TERRIER        BLACK      BAILEY     15129
8  SHETLAND SHEEPDOG  WHITE/BROWN  ZOE VITSAS     15238